import sqlite3
def fill_database():
    conn = sqlite3.connect("student.db")
    cursor = conn.cursor()

    cursor.executescript("""

    INSERT INTO groups (group_name, specialty) 
    VALUES
    ('КН-21', 'Комп''ютерні науки'),
    ('КН-22', 'Комп''ютерні науки');



    INSERT INTO dorm_rooms (room_number) VALUES
    ('101'),
    ('102'),
    ('103'),
    ('104');



    INSERT INTO persons
    (birth_date, birth_place,
    address, gender, marital_status)
    VALUES

    ('2004-03-12','Дніпро',
    'м. Дніпро','Ч','Неодружений'),

    ('2003-06-18','Київ',
    'м. Київ','Ч','Неодружений'),

    ('2004-01-25','Львів',
    'м. Львів','Ж','Неодружена'),

    ('2003-09-10','Харків',
    'м. Харків','Ж','Неодружена'),

    ('2004-11-03','Одеса',
    'м. Одеса','Ч','Неодружений'),

    ('2004-04-15','Полтава',
    'м. Полтава','Ч','Неодружений'),

    ('2003-12-08','Запоріжжя',
    'м. Запоріжжя','Ж','Неодружена'),

    ('2004-05-20','Черкаси',
    'м. Черкаси','Ч','Неодружений'),

    ('1985-03-03','Київ',
    'м. Київ','Ж','Одружена'),

    ('1978-09-11','Дніпро',
    'м. Дніпро','Ч','Одружений');







    INSERT INTO person_names
    (person_id,last_name,first_name,middle_name,valid_from,valid_to)
    VALUES

    (1,'Іваненко','Іван','Іванович',
    '2020-01-01',NULL),

    (2,'Петренко','Петро','Олегович',
    '2020-01-01',NULL),

    (3,'Петренко','Марія','Ігорівна',
    '2020-01-01','2023-06-30'),

    (3,'Сидоренко','Марія','Ігорівна',
    '2023-07-01',NULL),

    (4,'Коваленко','Олена','Сергіївна',
    '2020-01-01',NULL),

    (5,'Шевченко','Андрій','Петрович',
    '2020-01-01',NULL),

    (6,'Мельник','Дмитро','Васильович',
    '2020-01-01',NULL),

    (7,'Ткаченко','Анна','Юріївна',
    '2020-01-01',NULL),

    (8,'Бондар','Максим','Олександрович',
    '2020-01-01',NULL),

    (9,'Лисенко','Світлана','Миколаївна',
    '2010-01-01',NULL),

    (10,'Романенко','Василь','Іванович',
    '2010-01-01',NULL);



    INSERT INTO students
    (person_id,
    education_identifier,
    student_card_number,
    group_id,
    scholarship_amount,
    room_id)
    VALUES
    (1,100000001,'ST001',1,2000,1),
    (2,100000002,'ST002',1,1800,1),
    (3,100000003,'ST003',1,2200,2),
    (4,100000004,'ST004',1,1900,2),
    (5,100000005,'ST005',1,1500,3),
    (6,100000006,'ST006',2,1700,3),
    (7,100000007,'ST007',2,2100,4),
    (8,100000008,'ST008',2,1600,4);




    UPDATE groups
    SET monitor_student_id = 1
    WHERE id = 1;



    UPDATE groups
    SET monitor_student_id = 6
    WHERE id = 2;



    INSERT INTO teachers(person_id)
    VALUES(9),(10);



    INSERT INTO subjects(name, teacher_id)
    VALUES
    ('Бази даних',1),
    ('Програмування',1),
    ('Мережі',2),
    ('Алгоритми',2);



    INSERT INTO scholarships
    (student_id, semester, amount)
    VALUES

    (1,'2025-1',2000),
    (2,'2025-1',1800),
    (3,'2025-1',2200),
    (4,'2025-1',1900),
    (5,'2025-1',1500),
    (6,'2025-1',1700),
    (7,'2025-1',2100),
    (8,'2025-1',1600);



    INSERT INTO hobbies(hobby_name)
    VALUES
    ('Футбол'),
    ('Шахи'),
    ('Програмування'),
    ('Читання'),
    ('Подорожі');



    INSERT INTO student_hobbies
    VALUES
    (1,1),
    (1,3),
    (2,2),
    (3,4),
    (4,5),
    (5,3),
    (6,1),
    (7,4),
    (8,2);



    INSERT INTO books
    (inventory_number,title,author,genre,price)
    VALUES

    ('B001','Кобзар','Тарас Шевченко','Поезія',120),
    ('B002','Лісова пісня','Леся Українка','Драма',100),
    ('B003','1984','Джордж Орвелл','Роман',150),
    ('B004','Майстер і Маргарита','Булгаков','Роман',180),
    ('B005','SQL для початківців','Іванов','Навчальна',250);



    INSERT INTO book_loans
    (student_id,book_id,loan_date,return_date)
    VALUES

    (1,1,'2024-01-01',NULL),
    (1,2,'2024-03-01',NULL),
    (2,3,'2025-10-01',NULL),
    (3,4,'2025-05-01','2025-05-20'),
    (4,5,'2025-04-15',NULL);



    INSERT INTO grades
    (student_id,
    subject_id,
    points,
    national_grade,
    semester)
    VALUES

    (1,1,98,'Відмінно','2025-1'),
    (1,2,95,'Відмінно','2025-1'),
    (1,3,90,'Відмінно','2025-1'),

    (2,1,84,'Добре','2025-1'),
    (2,2,81,'Добре','2025-1'),
    (2,3,76,'Добре','2025-1'),

    (3,1,92,'Відмінно','2025-1'),
    (3,2,89,'Добре','2025-1'),
    (3,3,93,'Відмінно','2025-1'),

    (4,1,72,'Добре','2025-1'),
    (4,2,68,'Задовільно','2025-1'),
    (4,3,70,'Добре','2025-1'),

    (5,1,60,'Задовільно','2025-1'),
    (5,2,55,'Задовільно','2025-1'),
    (5,3,40,'Незадовільно','2025-1');




    """)

    conn.commit()
    conn.close()

    print("Дані додано.")
